"""
Вычислить число c заданной точностью d
Пример:
- при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$

!!!!!!!!!!!!!!!!!!!!!!!!

Поработайте, пожалуйста, над условиями задач, они трудно понятны.
Как я понимаю, нужно округлить число pi до разрядности d, при этом
d лежит в определенном диапозоне от 0.1 до 0.0000000001

Вариант 1. однострочник
"""

import math

print((lambda d: round(math.pi, len(str(d)) - 2) if 10 ** (-1) >= d >= 10 ** (-10)
        else print('out of range'))(float(input('Enter rounder (at 0.1 to 0.0000000001) '))))
