"""
Задайте последовательность чисел.
Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

!!!!!!!!!!!!!

Вообще не ясно.
Последовательность задается формулой, формулы в условии нет,
значит это просто перебор Х от 1 до X от 1+n
Да даже если через формулу функции, то как элементы могут быть повторяющимися,
если последовательность может быть возрастающая, либо убывающая,
то есть каждый элемент идет к бесконечности, либо ограниченным шагом n.

Вот если сравнивать две последовательности, полученные из разных функций, то да, возможно.

Так как условие не понял, предлагаю свое:
1. Первая последовательность вида a = 4n-1
2. Вторая последовательность вида b = (n-1)+n
3. Вывожу только уникальные элементы обеих последовательностей
"""


def func():
    count = 1
    n = int(input('Enter number for N '))
    answer = set()
    while count != n:
        func_one = 4 * count - 1
        func_two = (count - 1) + count
        answer.add(func_one)
        answer.add(func_two)
        count += 1
        print(f'First sequence = {func_one}. Second sequence = {func_two}')
    print(answer)


func()