"""
Напишите программу, которая по заданному номеру четверти,
показывает диапазон возможных координат точек в этой четверти (x и y).
"""

numb = int(input('Введите номер четверти (от 1 до 4) '))
if numb == 1:
    print('x, y - все значения >= 0')
elif numb == 2:
    print('x - все значения >= 0, y - все значения <= 0')
elif numb == 3:
    print('x - все значения <= 0, y - все значения <= 0')
elif numb == 4:
    print('x - все значения <= 0, y - все значения >= 0')
elif numb <= 1 or numb >= 4:
    print('Значение должно быть от 1 до 4')
