"""
Задайте список из нескольких чисел.
Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
Пример:
- [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12
"""


def func(x):
    s = 0
    for i in range(len(x)):
        s = s + x[i]
    print(s)


a = int(input('Enter number "a" for range (a, b) '))
b = int(input(f'Enter number "b" for range ({a}, b) '))
# Сразу сгенерирую список нечетных чисел, что бы сделать код короче.
# Его в любом случае потом прогонять через цикл, так сделаю сразу, а так смысл мне ясен.
lst = [i for i in range(a, b + 1) if i % 2 != 0]
print(lst)
func(lst)
