"""
Задайте список из N элементов, заполненных числами из промежутка [-N, N].
Найдите произведение элементов на указанных позициях.
Позиции хранятся в файле file.txt в одной строке одно число.

!!!!!!!!!!!!!!!

Опять условие не понятно:
1. На каких позициях нужно найти произведение элементов?
2. Где взять этот file.txt (в закрепе нет приложений) или его нужно создать и чем тогда заполнить?

Я сделаю так:
1. Создам список от [-N, N]
2. Каждое значение от [-N, N] будет добавлено в file.txt
3. Далее будет вывод произведение всех значения в file.txt
"""
def f(a, b):
    create_list = [i for i in range(a, b+1) if i != 0]
    answer = 0
    temp = 1
    #Исключаю 0, так как произведение на 0 = 0
    with open('file.txt', 'w') as r:
        for i in range(len(create_list)):
            print(str(create_list[i]), file=r)
            # Тут print используется для записи на новой строке без использования \n
    with open('file.txt', 'r') as r:
        for l in r:
            answer = temp * int(l)
            temp = temp * int(l)
    print(create_list)
    print(answer)

f(-1, 5)